function y=qualityclass(a)
% 变量输入顺序严格按照国家标准表格
if (a(1)>=60)&&(a(2)>=14)&&(a(3)>=30)&&(a(4)>=40)&&(a(5)>=60)&&(a(6)>=8)&&(a(7)>=350)&&(a(8)>=90)
    y=1; % high-gluten
elseif (a(1)>=60)&&(a(2)>=13)&&(a(3)>=28)&&(a(4)>=35)&&(a(5)>=58)&&(a(6)>=6)&&(a(7)>=300)&&(a(8)>=90)
    y=2; % medium-high-gluten
elseif (a(1)>=50)&&(a(2)>=12.5)&&(a(3)>=26)&&(a(4)>=30)&&(a(5)>=56)&&(a(6)>=3)&&(a(7)>=200)&&(a(8)>=50)
    y=3; % medium-gluten
elseif (a(1)<50)&&(a(2)<12.5)&&(a(3)<26)&&(a(4)<30)&&(a(5)<56)&&(a(6)<3)
    y=4; % low-gluten
else
    y=0; % below standard
end

end



